Билет14/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Document>

Билет14/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет14/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет14/src/Documents/ПриходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыОстатки.Накладная КАК Накладная,
		|	ВзаиморасчетыОстатки.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОстатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.РоссийскийРубль)
		|			ТОГДА ВзаиморасчетыОстатки.СуммаОстаток
		|		ИНАЧЕ ВзаиморасчетыОстатки.СуммаОстаток * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0)
		|	КОНЕЦ КАК СуммаВРублях,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОстатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.РоссийскийРубль)
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0)
		|	КОНЕЦ КАК Курс
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСрезПоследних
		|		ПО (КурсыВалютСрезПоследних.Валюта = ВзаиморасчетыОстатки.Валюта)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВзаиморасчетыОстатки.Накладная.МоментВремени";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СуммаСписать = СуммаОплаты; 
	//списание долгов по накладным в порядке и с разными валютами
	Пока Выборка.Следующий() и СуммаСписать > 0 Цикл
		ТекСумма = Мин(СуммаСписать, Выборка.СуммаВРублях);
		Движение = Движения.Взаиморасчеты.ДобавитьРасход();
		Движение.Контрагент = Контрагент;
		Движение.Валюта = Выборка.Валюта;
		Движение.период = Дата;
		Движение.Накладная = Выборка.Накладная;
		Если Выборка.Курс = 0 Тогда
			Отказ = Истина;
		     Сообщить(СтрШаблон("Незаполнен курс валют по %1 за %2", Выборка.Валюта, Дата));
		Иначе	
		     Движение.Сумма = ТекСумма / Выборка.Курс;
		КонецЕсли;
		
		СуммаСписать = СуммаСписать - ТекСумма;
	КонецЦикла;
	Если СуммаСписать > 0 Тогда
	    //если перепата то идет в аванс с пустой ссылкой
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Контрагент = Контрагент;
		Движение.Валюта = Справочники.Валюты.РоссийскийРубль;
		Движение.период = Дата;
		Движение.Накладная = Документы.РасходнаяНакладная.ПустаяСсылка();
		Движение.Сумма = СуммаСписать;
	КонецЕсли;
КонецПроцедуры
